In [1]:
import pandas as pd

income_df = pd.read_csv('Resources/income_data.csv')
age_df = pd.read_csv('Resources/Age_Data.csv')

In [2]:
income_df

      Unnamed: 0  Year        City  Median Income
0              0  2018  Albany, NY          45500
1              1  2017  Albany, NY          43790
2              2  2016  Albany, NY          42335
3              3  2015  Albany, NY          40949
4              4  2014  Albany, NY          41099
...          ...   ...         ...            ...
1471        1471  2017   Tampa, FL          50489
1472        1472  2016   Tampa, FL          50405
1473        1473  2015   Tampa, FL          44432
1474        1474  2014   Tampa, FL          45709
1475        1475  2013   Tampa, FL          42649

[1476 rows x 4 columns]

In [3]:
income_df = income_df.rename(columns= {'Household Income by Race': 'Household Income'})

In [4]:
income_df['Year'].unique()

array([2018, 2017, 2016, 2015, 2014, 2013], dtype=int64)

In [5]:
drop_years = [2013, 2014]
for year in drop_years:
    income_df.drop(income_df.loc[income_df['Year']==year].index, inplace=True)
    age_df.drop(age_df.loc[age_df['Year']==year].index, inplace=True)

In [6]:
income_df['City'].unique()

array(['Albany, NY', 'Atlanta, GA', 'Boise City, ID', 'Boston, MA',
       'Buffalo, NY', 'Charlotte, NC', 'Chicago, IL', 'Cincinnati, OH',
       'Columbus, OH', 'Dallas, TX', 'Denver, CO', 'Detroit, MI',
       'Grand Rapids, MI', 'Harrisburg, PA', 'Hartford, CT',
       'Houston, TX', 'Indianapolis city (balance), IN',
       'Jacksonville, FL', 'Las Vegas, NV', 'Los Angeles, CA',
       'Miami, FL', 'Nashville, NC', 'New Orleans, LA', 'New York, NY',
       'Orlando, FL', 'Philadelphia, PA', 'Phoenix, AZ', 'Pittsburgh, PA',
       'Portland, OR', 'Raleigh, NC', 'Richmond, VA', 'Roanoke, VA',
       'Sacramento, CA', 'San Diego, CA', 'San Francisco, CA',
       'Seattle, WA', 'Spokane, WA', 'St. Louis, MO', 'Syracuse, NY',
       'Tampa, FL'], dtype=object)

In [7]:
age_df['Age Range'].unique()

array(['18 to 24 Years', '75 Years & Over', '45 to 54 Years',
       'Under 5 Years', '65 to 74 Years', '35 to 44 Years',
       '55 to 59 Years', '5 to 17 Years', '62 to 64 Years',
       '25 to 34 Years', '60 & 61 Years'], dtype=object)

In [8]:
income_df.to_csv('Resources/clean_income_data.csv')
age_df.to_csv('Resources/clean_age_data.csv')